app/views/beer_clubs/_beer_club.html.erb

              <%= link_to membership.user.username, membership.user %> (Pending confirmation)
              <% if current_user.memberships.where(beer_club_id: @beer_club.id, confirmed: true).exists? %>
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."beer_club_id" = ? AND "memberships"."user_id" = ? LIMIT ?  [["beer_club_id", 3], ["user_id", 21], ["LIMIT", 1]]