app/views/beer_clubs/show.html.erb

SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ?  [["user_id", 17]]
---

<% if current_user and current_user.memberships.map{ |m| m.beer_club_id }.exclude?(@beer_club.id) %>