app/views/users/show.html.erb

SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 1]]
SELECT 1 AS one FROM "ratings" WHERE "ratings"."user_id" = ? LIMIT ?  [["user_id", 21], ["LIMIT", 1]]
---

<% if @user.ratings.empty? %>

SELECT COUNT(*) FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 21]]
---
  <div>
    Has made <%= pluralize(@user.ratings.count, 'rating') %> with an average of <%= @user.average_rating %>