app/views/ratings/index.html.erb

SELECT "ratings".* FROM "ratings"
---
        <td><%= user.username %></td>
        <td><%= user.ratings.size %> ratings</td>