app/views/breweries/_brewery.html.erb

SELECT COUNT(*) FROM "beers" WHERE "beers"."brewery_id" = ?  [["brewery_id", 1]]
SELECT "beers".* FROM "beers" WHERE "beers"."brewery_id" = ?  [["brewery_id", 1]]
---
    Beers count:
    <%= brewery.beers.count %>

SELECT SUM("ratings"."score") FROM "ratings" INNER JOIN "beers" ON "ratings"."beer_id" = "beers"."id" WHERE "beers"."brewery_id" = ?  [["brewery_id", 1]]
---
          <td><%= beer.style.name %></td>
          <td><%= beer.ratings.average(:score) %></td>