app/views/beers/_beer.html.erb


  <% if beer.ratings.empty? %>
---
SELECT 1 AS one FROM "ratings" WHERE "ratings"."beer_id" = ? LIMIT ?  [["beer_id", 1], ["LIMIT", 1]]