app/views/beers/_form.html.erb

    <%= form.label :brewery_id, style: "display: block" %>
    <%= form.collection_select :brewery_id, Brewery.all, :id, :name %>
---
SELECT "breweries".* FROM "breweries"