app/views/beers/show.html.erb

SELECT "ratings".* FROM "ratings" WHERE "ratings"."beer_id" = ?  [["beer_id", 1]]
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."beer_id" = ?  [["beer_id", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."beer_id" = ?  [["beer_id", 2]]
---

<% if @beer.ratings.present? %>
  <p>Beer has <%= @beer.ratings.size %> ratings with an average of <%= @beer.average_rating.to_f.round(2) %></p>