app/controllers/application_controller.rb

    def current_user
      return nil if session[:user_id].nil?
      User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]