app/controllers/beers_controller.rb

  def index
    @beers = Beer.all
---
SELECT "beers".* FROM "beers"

  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("name", "style", "brewery_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Blanc"], ["style", "Weizen"], ["brewery_id", 1], ["created_at", "2023-09-04 11:13:11.304440"], ["updated_at", "2023-09-04 11:13:11.304440"]]

  def update
    respond_to do |format|
      if @beer.update(beer_params)
---
UPDATE "beers" SET "name" = ?, "style" = ?, "updated_at" = ? WHERE "beers"."id" = ?  [["name", "Blanc\""], ["style", "Weizen"], ["updated_at", "2023-09-04 11:08:50.726525"], ["id", 21]]

  def destroy
    @beer.destroy
---
DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 23]]

  def set_breweries_and_styles_for_template
    @breweries = Brewery.all
---
SELECT "breweries".* FROM "breweries"

  def set_beer
    @beer = Beer.find(params[:id])
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]