app/controllers/beer_clubs_controller.rb

SELECT "beer_clubs".* FROM "beer_clubs"
---
  def index
    @beer_clubs = BeerClub.all

SELECT "memberships".* FROM "memberships" WHERE "memberships"."beer_club_id" = ? AND "memberships"."user_id" = ? LIMIT ?  [["beer_club_id", 3], ["user_id", 21], ["LIMIT", 1]]
---
  def show
    return unless current_user

    @membership = Membership.find_by(beer_club: @beer_club, user: current_user)

INSERT INTO "beer_clubs" ("name", "founded", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "ss"], ["founded", 1222], ["city", "helsinki"], ["created_at", "2023-12-05 15:47:50.242695"], ["updated_at", "2023-12-05 15:47:50.242695"]]
---
  def create
    @beer_club = BeerClub.new(beer_club_params)

    respond_to do |format|
      if @beer_club.save

DELETE FROM "beer_clubs" WHERE "beer_clubs"."id" = ?  [["id", 1]]
---
  def destroy
    @beer_club.destroy

SELECT "beer_clubs".* FROM "beer_clubs" WHERE "beer_clubs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_beer_club
    @beer_club = BeerClub.find(params[:id])