app/controllers/breweries_controller.rb

SELECT "breweries".* FROM "breweries"
---
  def index
    @breweries = Brewery.all

SELECT "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "ratings" INNER JOIN "beers" ON "ratings"."beer_id" = "beers"."id" WHERE "beers"."brewery_id" = ?  [["brewery_id", 1]]
---
  def show
    @brewery = Brewery.find(params[:id])
    @ratings_count = @brewery.ratings.count

INSERT INTO "breweries" ("name", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Lönkka"], ["year", 2012], ["created_at", "2023-07-18 10:11:57.607716"], ["updated_at", "2023-07-18 10:11:57.607716"]]
---
  def create
    @brewery = Brewery.new(brewery_params)

    respond_to do |format|
      if @brewery.save

DELETE FROM "breweries" WHERE "breweries"."id" = ?  [["id", 6]]
---
  def destroy
    @brewery.destroy

SELECT "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_brewery
    @brewery = Brewery.find(params[:id])