app/controllers/memberships_controller.rb

INSERT INTO "memberships" ("user_id", "beer_club_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 17], ["beer_club_id", 3], ["created_at", "2023-12-05 16:10:50.264226"], ["updated_at", "2023-12-05 16:10:50.264226"]]
---
  def create
    @membership = Membership.new(membership_params)
    @membership.user = current_user
    @membership.confirmed = false

    respond_to do |format|
      if @membership.save

SELECT "memberships".* FROM "memberships" WHERE "memberships"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 8]]
---
  def destroy
    @membership = Membership.find(params[:id])
    @membership.destroy

SELECT "memberships".* FROM "memberships" WHERE "memberships"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "beer_clubs".* FROM "beer_clubs" WHERE "beer_clubs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "memberships".* FROM "memberships" WHERE "memberships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def confirm
    @membership = Membership.find(params[:id])
    if current_user.memberships.where(beer_club_id: @membership.beer_club_id, confirmed: true).exists?

SELECT "memberships".* FROM "memberships" WHERE "memberships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_membership
    @membership = Membership.find(params[:id])

SELECT "beer_clubs".* FROM "beer_clubs" WHERE 1=1
SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = ?  [["user_id", 17]]
---
  def set_beer_clubs
    memberships_of_current = current_user.memberships.map(&:beer_club)

SELECT "beer_clubs".* FROM "beer_clubs" WHERE "beer_clubs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_membership_to_delete
    @membership = Membership.find_by(beer_club_id: params[:membership][:beer_club_id], user_id: current_user.id)
    @beer_club = BeerClub.find(params[:membership][:beer_club_id])