app/controllers/ratings_controller.rb

SELECT "ratings".* FROM "ratings"
---
  def index
    @ratings = Rating.all

SELECT "beers".* FROM "beers"
---
  def new
    @rating = Rating.new
    @beers = Beer.all

INSERT INTO "ratings" ("score", "beer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["score", 15], ["beer_id", 8], ["created_at", "2023-08-15 12:07:41.540065"], ["updated_at", "2023-08-15 12:07:41.540065"]]
---
  def create
    # otetaan luotu reittaus muuttujaan
    rating = Rating.create params.require(:rating).permit(:score, :beer_id)

SELECT "ratings".* FROM "ratings" WHERE "ratings"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 21]]
---
  def destroy
    rating = Rating.find(params[:id])
    rating.delete