app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["username", "testi"], ["created_at", "2023-09-02 11:59:53.238807"], ["updated_at", "2023-09-02 11:59:53.238807"], ["password_digest", "[FILTERED]"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 18]]
---
  def destroy
    @user = User.find(params[:id])
      if current_user == @user

      reset_session

      @user.destroy