app/models/user.rb

SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def favorite_by(my_ratings, criteria)
    by_criteria = my_ratings
                  .group_by { |rating| rating.beer.send(criteria) }
                  .map { |key, val| [key, val.sum(&:score) / val.size] }