app/views/layouts/application.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <% if not session[:user_id].nil? %>
      <p><%= User.find(session[:user_id]).username %> signed in</p>